# Step 3

Import your analysis libraries, as well as your new customer data set as a dataframe.

In [3]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [4]:
#create a path
path = r'C:\Users\Maya\OneDrive\Documents\CareerFoundry\Achievement 4 - Python Fundamentals for Data Analysts\Jupyter Instacart Basket Analysis'
#import customers.csv
df_cust = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'customers.csv'))
#import ords_prods_merge_with_agg
ords_prods = pd.read_pickle(os.path.join(path, 'Data', 'Prepared Data', 'orders_products_merged_new_with_agg.pkl'))

In [5]:
df_cust.shape

(206209, 10)

In [6]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [7]:
df_cust.columns

Index(['user_id', 'First Name', 'Surnam', 'Gender', 'STATE', 'Age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

In [8]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [9]:
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

# Step 4

Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [10]:
#rename columns
df_cust.rename(columns = {'First Name': 'first_name'}, inplace=True)

In [11]:
df_cust.rename(columns = {'Surnam': 'last_name'}, inplace=True)

In [12]:
df_cust.rename(columns = {'Gender': 'gender'}, inplace=True)

In [13]:
df_cust.rename(columns = {'STATE': 'state'}, inplace=True)

In [14]:
df_cust.rename(columns = {'Age': 'age'}, inplace=True)

In [15]:
df_cust.rename(columns = {'n_dependants': 'no_of_dependents'}, inplace = True)

In [16]:
df_cust.rename(columns = {'fam_status': 'marital_status'}, inplace=True)

In [17]:
#check column names
df_cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,no_of_dependents,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Step 5

Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [18]:
#check for mixed-type columns
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

first_name

In [19]:
#change data type for first_name
df_cust['first_name'] = df_cust['first_name'].astype('str')

In [20]:
#check that the above worked
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

In [21]:
#check for missing values
df_cust.isnull().sum()

user_id             0
first_name          0
last_name           0
gender              0
state               0
age                 0
date_joined         0
no_of_dependents    0
marital_status      0
income              0
dtype: int64

In [22]:
#check for duplicates
df_dups = df_cust[df_cust.duplicated()]
df_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, no_of_dependents, marital_status, income]
Index: []

In [24]:
df_cust.shape

(206209, 10)

# Step 6

Combine your customer data with the rest of your prepared Instacart data. Tip: Make sure the key columns are of the same data type! Hint: Make sure the key columns are the same data type!

In [23]:
# check data types
ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32399732 entries, 0 to 32399731
Data columns (total 22 columns):
 #   Column                  Dtype
---  ------                  -----
 0   product_id              int64
 1   product_name            object
 2   aisle_id                int64
 3   department_id           int64
 4   prices                  float64
 5   order_id                int64
 6   user_id                 int64
 7   order_number            int64
 8   order_day_of_week       int64
 9   order_hour_of_day       int64
 10  days_since_prior_order  float64
 11  add_to_cart_order       int64
 12  reordered               int64
 13  _merge                  category
 14  busiest_days            object
 15  busiest_period_of_day   object
 16  max_order               int64
 17  loyalty_flag            object
 18  mean_prices_by_user     float64
 19  type_of_spender         object
 20  dsp_order_median        float64
 21  order_frequency_flag    object
dtypes: category(1), float64(4), int64(11), object(6)
memory usage: 5.3+ GB

In [26]:
orders_products_all = df_cust.merge(ords_prods, on = 'user_id')

In [27]:
orders_products_all.head()

,user_id,first_name,last_name,gender,state,age,date_joined,no_of_dependents,marital_status,income,...,reordered,_merge,busiest_days,busiest_period_of_day,max_order,loyalty_flag,mean_prices_by_user,type_of_spender,dsp_order_median,order_frequency_flag
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,0,both,Busiest days,Average orders,8,New customer,7.988889,Low spender,19.0,Regular customer
1,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,1,both,Regularly busy days,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer
2,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,1,both,Busiest days,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer
3,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,0,both,Regularly busy days,Average orders,8,New customer,7.988889,Low spender,19.0,Regular customer
4,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,1,both,Least busy days,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer

In [28]:
orders_products_all.shape

(32399732, 31)

# Step 8

Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [29]:
orders_products_all.to_pickle(os.path.join(path, 'Data','Prepared Data', 'orders_products_all.pkl'))